title: PowerShell Download and Execute Pattern
id: ddd7d88c-ps-download-exec
status: experimental
description: Detects PowerShell downloading a file and executing it immediately
author: wrench
date: 2026/01/28
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\powershell.exe'
    CommandLine|contains|all:
      - 'DownloadFile'
      - 'Start-Process'
  condition: selection
level: critical
tags:
  - attack.execution
  - attack.t1105